//===================================================================
// Contents    : AOJ ITP1_3_D
//               3つの整数 a、b、c を読み込む。
//               a から b までの整数の中に、c の約数がいくつあるかを求める
// Constraints : 1 ≤ a , b , c ≤ 10000
// Author      : 廣部智也
// LastUpdate  :
// Since       : 2020/05/23
//===================================================================

#include <stdio.h>

int main(){
    
    int a  = 0, b = 0, c = 0, i = 0, count = 0;
    
    // データの入力
    scanf("%d %d %d",&a ,&b ,&c );
    
    if( a < 1 || a > 10000 || b < 1 || b > 10000 || c < 1 || c > 10000 ){
        return 0;
    }
    
    // データの処理：a から b の値で、c を割り切れるか調べていく
    for( i = a ; i <= b ; i++ ){
        
        if( i > c ){                    // c < a や c < b のときは、ループの途中で抜ける
            break;
        }

        if( c % i == 0 ){
            count++;
        }
        
    }
    
    // データの入力
    printf("%d\n", count );
    
    return 0;
}
