/*ex3_4
    takafumi_ueki*/
#include <stdio.h>
int main(void){
    int x;
    scanf("%d",&x);
    /*例えば,xを2で割った余りが０（２で割り切れる）かつ
    ２で割った商が10未満だったら一桁の整数同士の掛け算で表せるということなので、それを3,4,5,,,,と調べる。*/
    if(((x%1 == 0)&&((x/1)<10))||((x%2 == 0)&&((x/2)<10))||((x%3 == 0)&&((x/3)<10))||((x%4 == 0)&&((x/4)<10))||((x%5 == 0)&&((x/5)<10))||((x%6 == 0)&&((x/6)<10))||((x%7 == 0)&&((x/7)<10))||((x%8 == 0)&&((x/8)<10))||((x%9 == 0)&&((x/9)<10))){
        printf("Yes\n");
    }
    else{
        printf("No\n");
    }
    return 0;
}
